tap "ublue-os/tap"
tap "anomalyco/tap"

# CLI tools managed via Homebrew
# Install with: brew bundle --global

cask "claude-code@latest"
cask "antigravity-cli-linux"

brew "atuin"       # shell history with SQLite backend and Ctrl+R search
brew "bat"         # cat with syntax highlighting
brew "block-goose-cli"
brew "aider"           # AI pair programming in the terminal (code surgeon — § 4.C)
brew "opencode"        # Terminal AI coding agent (Goose alternative)
brew "pi-coding-agent" # Terminal AI coding agent (Node-based)
brew "dust"        # du replacement with visual tree
brew "duf"         # df replacement with visual output
brew "eza"         # ls replacement with colors/icons/git info
brew "fastfetch"   # system info fetcher
brew "fd"          # find replacement
brew "gh"          # GitHub CLI
brew "git-delta"   # syntax-highlighted git diff pager
brew "bottom"      # htop alternative with graphs; command: btm
brew "cava"        # console-based audio visualizer
brew "glow"        # Markdown renderer for the terminal
brew "lazygit"     # TUI for git
brew "chafa"       # terminal image renderer with Sixel/Kitty support
brew "ramalama"    # run AI models in containers
brew "ripgrep"     # grep replacement
brew "television"  # fuzzy finder TUI with live previews
brew "tealdeer"    # simplified man pages (fast Rust tldr client)
brew "yq"          # jq-style processor for YAML/TOML/XML
brew "ouch"        # archive tool (zip, tar, gz, zst, etc.)
brew "pandoc"       # universal document converter (used by pi-markdown-preview)
brew "vdirsyncer"  # sync CalDAV/CardDAV calendars/contacts to local storage
brew "yt-dlp"      # video downloader
brew "starship"    # cross-shell prompt
brew "zoxide"      # smart cd replacement
brew "fzf-tab"     # replace zsh completion menu with fzf
brew "pipx"        # isolated Python CLI tool installer
brew "gcc"         # C compiler — needed to build Python packages with native extensions (e.g. headroom-ai)
brew "python@3.13" # pinned Python for packages incompatible with 3.14 (e.g. headroom-ai pyo3 cap)


cask "font-crimson-pro" # elegant variable serif
